{
    "navigation": {
        "home": "Startseite",
        "about": "Über Mich",
        "resume": "Lebenslauf",
        "skills": "Kompetenzen",
        "projects": {
            "headline": "Projekte",
            "mmb": "MavsMoneyball",
            "nwoun": "Neverwinter Uncensored",
            "jferda": "j0shi.dev",
            "lwm": "Last War Manager",
            "edom": "e-domizil.de",
            "neighboring": "Neighboring Satellites"
        },
        "animationSwitchLabel": "Animationen"
    },
    "locale": {
        "headline": "Sprace",
        "en": "English",
        "de": "Deutsch"
    },
    "home": {
        "maintext": "Hallo! Mein Name ist <b>Janosch</b>. Ich bin <b>Full-Stack Web-Entwickler</b> aus Deutschland und habe Spaß an Erstellen von schnellen, optimierten und modernen <b>Javascript</b> Applikationen. Ich lade dich auf meiner Webseite ein, mehr über meine <b>Philosophie</b> und <b>Arbeit</b> zu erfahren."
    },
    "about": {
        "bio": {
            "headline": "Biographie",
            "bio1": "Angetrieben von Dingen, die ich brauchte aber nirgends finden konnte, programmiere ich schon seit 1997. Lange Zeit war es \"nur\" ein Hobby, welches aber oft mehr Zeit in Anspruch nahm als andere Tätigkeiten. Deshalb habe ich konsequenterweise an einem Scheidepunkt in meinem Leben beschlossen, meine Berufung auch zu meinem Beruf zu machen.",
            "bio2": "Obwohl ich wenig Erfahrung in der professionellen IT-Arbeitswelt vorzuweisen hatte, war der Übergang einfach. Ich habe mich seinerzeit für Web-Entwicklung entschieden, weil ohnehin viele meiner Hobby-Projekte darauf basierten. Zudem war ich schon immer beeindruckt von den Möglichkeiten des Webs und empfand es als extrem zufrieden stellend, wie einfach man dort seine Arbeit der Welt präsentieren konnte.",
            "bio3": "Über die Jahre bin ich mit vielen Programmiersprachen und Umgebungen in Berührung gekommen. Meinen ersten Code überhaupt verfasste ich in Visual Basic, bevor ich über ein kleines Intermezzo in C zu Web-Applikationen in PHP/SQL und HTML/CSS kam. Die berüchtigte jQuery-Bibliothek war dann mein Einstieg in JavasScript und über die Zeit ist dies und diverse verwandte Frameworks zu meiner Kernkompetenz herangewachsen."
        },
        "philosophy": {
            "headline": "Coding heißt für mich...",
            "satisfaction": {
                "headline": "Befriedigung",
                "text": "Innerhalb einer Applikation gibt es so gut wie keine Probleme, die man nicht lösen könnte. Das macht Entwicklung zu einem befriedigenden Belohnungssystem, welches immer wieder Erfolge generiert."
            },
            "community": {
                "headline": "Gemeinschaft",
                "text": "Die Teilnahme an verschiedenen Gemeinschaften und der Open-Source-Bewegung ist ein exzellenter Weg, um sich fortwährend auszutauschen, ohne viel Aufwand neue Wege zu beschreiten und die Qualität der eigenen Arbeit zu verbessern."
            },
            "creativity": {
                "headline": "Kreativität",
                "text": "Niemand würde Programmieren mit Kunst vergleichen. Aber warum eigentlich nicht? Entwickler sind in der Lage aus Nichts etwas entstehen zu lassen und die einzigen Hilfsmittel sind Kreativität, Logik, und Vorstellungskraft."
            },
            "helloworld": {
                "headline": "Hallo Welt",
                "text": "Sein Schaffen der Welt zu präsentieren ist ein integraler Bestandteil meiner Motivation. Auch und gerade der Austausch mit Benutzern einer Software schätze ich wert und hilft mir, niemals stehen zu bleiben."
            },
            "progressive": {
                "headline": "Fortschritt",
                "text": "Entwicklung ist ein Bereich des konstanten Wandels. Dank Innovation und moderne Technologien hilft es sogar im besten Fall, die Welt zu einem besseren Ort für alle zu machen."
            },
            "lit": {
                "headline": "Trendy",
                "text": "Das Label \"nerdy\" ist für mich längst kein Vorurteil mehr, sondern Verpflichtung und Lebensart. Meine Generation ist lebensoffen, modern, und sozial."
            },
            "givingback": {
                "headline": "Zurückgeben",
                "text": "Ich bin immer interessiert daran, zu lernen und mich weiterzuentwickeln. Aber ich lebe auch vom Austausch und Weitergeben meiner persönlichen Erfahrung, um den Horizont anderer in gleicher Weise zu erweitern."
            }
        }
    },
    "resume": {
        "stillgoing": "since",
        "education": {
            "headline": "Education",
            "gym": "German university entrance qualification at different schools in Gelsenkirchen.",
            "uni": "Student of Bsc Psychology at Westfälische-Wilhelm-University in Münster.",
            "edom": "Apprentice as software developer at e-domizil.de in Münster."
        },
        "experience": {
            "headline": "Experience",
            "hs": "Side gig as editor at sports agency <a href='https://www.sport.de/' target='_blank'>Heim:Spiel Medien GmbH & Co. KG</a> in Münster. Developed complementary and assisting web apps and scripts for personal use.",
            "mmb": "Author and editor at <a href='https://www.mavsmoneyball.com/' target='_blank'>MavsMoneyball</a>, a NBA basketball community. Developed complementary and assisting web apps and scripts for personal use.",
            "nwoun": "Admin of <a href='https://blog.nwo-uncensored.com/' target='_blank'>Neverwinter Uncensored</a>, a community and software project for the MMORPG Neverwinter by Cryptic Studios and Perfect World Entertainment.",
            "edom": "Software development team member at <a href='https://www.e-domizil.de/' target='_blank'>e-domizil.de</a>, an online travel agency for holiday homes."
        }
    },
    "skills": {
        "software": "Software",
        "frameworks": "Frameworks / CMS",
        "jspackages": "Javascript Packages",
        "lang": "Languages",
        "js": "JavaScript",
        "php": "PHP",
        "wp": "Wordpress",
        "sql": "SQL",
        "jquery": "jQuery",
        "vue": "Vue",
        "laravel": "Laravel",
        "docker": "Docker",
        "bootstrap": "Bootstrap",
        "node": "Node",
        "css": "CSS"
    },
    "projects": {
        "learnmore": "Learn more",
        "skillsep": ", ",
        "mmb": {
            "desc": "MavsMoneyball was mainly a blogging project. It was great to cover a sport that I love and a team that I root for. But I did also develop a statistical app to complement my blog work."
        },
        "edom": {
            "desc": "This was the first commercial project I worked on. I was fortunate enough that I could be part of a full website rebuild and relaunch. Getting into the full range of full-stack development was a fun experience."
        },
        "nwoun": {
            "desc": "NWO:UN has been my biggest personal project to date. We served the game's community for nearly five years and delivered content and tools to over 100,000 players per month."
        },
        "neighboring": {
            "desc": "Neighboring Satellites is a publicly backed project that aims to support the local art scene in an emerging urban district. I was entrusted with the technical realization of the project's website."
        }
    },
    "project": {
        "desc": "Description",
        "highlights": "Key Features / Achievements",
        "skills": "Used Skills",
        "gallery": "Gallery",
        "links": {
            "web": "Website",
            "github": "Repository"
        },
        "nwoun": {
            "desc": "Neverwinter Uncensored was born in 2015 because I was searching for an independent news platform and community for a MMORPG I had played since 2013. And because there was none, I created it myself! Originally started as a fan project, NWO:UN grew to become the game's #1 fan site. In the heyday, we delivered our content and tools to over 100,000 players per month. It was a tough decision to shut down the site in January 2019, but unfortunately I was no longer able to properly maintain the site or create content.<br /><br />It was truly an insane experience. Building and managing a community and website is just so diverse. The core of the project was a Wordpress blog, which I customized (HTML, CSS, JS) to fit my needs, and online tools for the game build with the plugin system of a forum software (PHP, HTML, Javascript). But I also gained tons of experience in social platforms (Twitter, Discord, Facebook etc.), creating content (YouTube, Wordpress), as well as SEO, SEA, and monetization.",
            "highlights": {
                "1": {
                    "1": "Customized Wordpress Blog",
                    "2": "Integrated dozens of plugins",
                    "3": "Theme tweaks and plenty UI enhancements"
                },
                "2": {
                    "1": "Game-Specific Apps",
                    "2": "Data fetching without official API",
                    "3": "Unique PHP/Javascript based online tools"
                },
                "3": {
                    "1": "Monthly Traffic",
                    "2": "100,000+ Users",
                    "3": "350,000+ Page Views"
                },
                "4": {
                    "1": "Social Management",
                    "2": "Communities on Twitter, Discord, Facebook",
                    "3": "Integrated many social APIs"
                },
                "5": {
                    "1": "Full Branding",
                    "2": "Logos, Banners & Color Scheme",
                    "3": "Hundreds of self-made images"
                }
            },
            "links": {
                "blog": "Unblogged",
                "forum": "Uncensored"
            }
        },
        "edom": {
            "desc": "E-Domizil.de is an online travel agency for holiday homes. The site was completely rebuild and relaunched in 2019 with a microservice approach that focused on mobile-first, performance, SEO friendliness, and white-label capability. The project is built on Vue.js for client-side rendering and Node.js / Express for server-side rendering. The microservices so far all run on Lumen.<br /><br />As a full-time member of the tech team that completely built the software from scratch I was fortunate enough to operate a wide range of full-stack development tasks. The most fun I had designing core modules and functionalities like SSR logic, PWA/service worker, API logic, routing, internalization, bundling optimizations, and performance analysis as well as configuring and maintaining essential packages such as Babel, ESLint or Jest.<br /><br />Over the course of the project I gained lots of experience with Vue.js, especially regarding various SSR hurdles and general performance issues.",
            "highlights": {
                "1": {
                    "1": "Full-Stack Development",
                    "2": "Vue.js, Express, Docker",
                    "3": "Lumen, API design, Elastic Search"
                },
                "2": {
                    "1": "SEO & Performance",
                    "2": "Monitoring Core Web Vitals and other metrics",
                    "3": "Using cache techniques where applicable"
                },
                "3": {
                    "1": "A/B testing",
                    "2": "Made A/B testing possible on the SSR/SPA",
                    "3": "Custom solution using own db and Google"
                },
                "4": {
                    "1": "Datepicker Integration",
                    "2": "Customized Flatpickr to fit our needs",
                    "3": "Multiple pickers on single page sync"
                },
                "5": {
                    "1": "Legacy Browser Support",
                    "2": "Support all browsers down to IE 11",
                    "3": "Separate bundles for modern and legacy clients"
                }
            },
            "links": {
                "edom": "e-domizil.de",
                "to": "tourist-online.de"
            }
        },
        "neighboring": {
            "desc": "Neighboring Satellites is an incredible project that tries to support the local art scene in a burgeoning environment. The most difficult task when working on the project's website was to fit the client's expecations in terms of design and layout. The most time was used to find a fitting theme and then customize it for our needs. Moderating between the realities of web and classic design was extremely fun as well as countless 'live' sessions in which we discussed and adjusted the layout.<br /><br />The rest was fairly standard with setting up a Wordpress blog on a simple webhost. We however tried to set up a system that's easy to maintain later so the authors will be able to do most of the editing and admin work themselves. That's why training folks that were new to publishing on the web, and with Wordpress, was also a key part of the process.",
            "highlights": {
                "1": {
                    "1": "Customized Wordpress Blog",
                    "2": "Taking care of base setup",
                    "3": "Integrated dozens of plugins"
                },
                "2": {
                    "1": "Train The Authors",
                    "2": "Teach inexperienced users WP basics",
                    "3": "Make sure setup is easy to maintain"
                },
                "3": {
                    "1": "Implement a Given Layout",
                    "2": "Search For a Fitting Theme",
                    "3": "Plenty Styling Adjustements"
                },
                "4": {
                    "1": "Legal Management",
                    "2": "Handle privacy logic",
                    "3": "Research necessary legal info"
                },
                "5": {
                    "1": "Elementor",
                    "2": "Getting used to the Elementor plugin",
                    "3": "Design pages using a given layout"
                }
            },
            "links": {
                "site": "Website"
            }
        }
    }
}