{
    "navigation": {
        "home": "Home",
        "about": "About",
        "resume": "Resume",
        "skills": "Skills",
        "projects": {
            "headline": "Projects",
            "mmb": "MavsMoneyball",
            "nwoun": "Neverwinter Uncensored",
            "jferda": "j0shi.dev",
            "lwm": "Last War Manager",
            "edom": "e-domizil.de"
        }
    },
    "locale": {
        "headline": "Language",
        "en": "English",
        "de": "Deutsch"
    },
    "home": {
        "maintext": "Hey, my name is <b>Janosch</b>. I'm a <b>full-stack web developer</b> from Germany with a focus on creating lightweight, fast, and modern <b>Javascript</b> applications. Explore this website to learn more about my <b>philosophy</b> and my <b>work</b>."
    },
    "about": {
        "bio": {
            "headline": "Biography",
            "bio1": "Driven by things that I needed and couldn't find elsewhere, I have been coding since 1997. For most of my life I was labeling coding a hobby. But in reality that 'hobby' often consumed more time than all other activities combined. That's why, when I got stuck in life and needed to make a decision about my future, I decided to finally turn my passion into a profession.",
            "bio2": "Although I surely had to get used to doing in a professional environment what I have been doing for much of my life, it was a smooth transition. It just felt natural and I'm glad I made that choice. I got into web development because most of my work had been web apps anyway. But more than that I had always been fascinated by the amount of possibilities the web offers. It has never been easier to connect with people and show your work to the world.",
            "bio3": "Over the years I naturally touched many areas of development. The first code I've ever written was in Visual Basic before trying (and failing at) C. Then my focus for years were web apps based on PHP/SQL (back end) and plain HTML/CSS (front end). The infamous jQuery library then got me into JavaScript and currently it's most of what I'm doing. This surely isn't the end of the road however and I'm eager to learn what's next and evolve as developer and person."
        },
        "philosophy": {
            "headline": "Coding is...",
            "satisfaction": {
                "headline": "Satisfaction",
                "text": "Within an app or project, there's not much you won't be able to do. That's why coding is a constant reward system that just keeps on giving, because you're    operating in a world in which pretty much all problems are solvable."
            },
            "community": {
                "headline": "Community",
                "text": "Participating in different coding communities is a great way to drive change, stay open-minded, and yield great results thanks to collective intelligence."
            },
            "creativity": {
                "headline": "Creativity",
                "text": "Nobody would compare coding to classic art. But why? Devs are able to create software out of thin air just using their imagination and creativity."
            },
            "helloworld": {
                "headline": "Hello World",
                "text": "Publishing, blogging, or generally expressing myself in showing the world my work is an integral part of who I am. Especially direct interaction with users keeps me engaged."
            },
            "progressive": {
                "headline": "Progressive",
                "text": "Coding is a field of constant change. It leads to innovation, cutting edge technology, and with the proper ideas even helps making the world a better place for everyone."
            },
            "lit": {
                "headline": "Rocking",
                "text": "The term 'nerdy' is no longer a contemporary label for developers. The new generation is a modern, open-minded, and social bunch. We do still consume energy drinks though."
            },
            "givingback": {
                "headline": "Giving Back",
                "text": "I'm eager to learn and evolve, but also always want to share or publish my personal experience to help others grow as well."
            }
        }
    },
    "resume": {
        "stillgoing": "since",
        "education": {
            "headline": "Education",
            "gym": "German university entrance qualification at different schools in Gelsenkirchen.",
            "uni": "Student of Bsc Psychology at Westf채lische-Wilhelm-University in M체nster.",
            "edom": "Apprentice as software developer at e-domizil.de in M체nster."
        },
        "experience": {
            "headline": "Experience",
            "hs": "Side gig as editor at sports agency <a href='https://www.sport.de/' target='_blank'>Heim:Spiel Medien GmbH & Co. KG</a> in M체nster. Developed complementary and assisting web apps and scripts for personal use.",
            "mmb": "Author and editor at <a href='https://www.mavsmoneyball.com/' target='_blank'>MavsMoneyball</a>, a NBA basketball community. Developed complementary and assisting web apps and scripts for personal use.",
            "nwoun": "Admin of <a href='https://blog.nwo-uncensored.com/' target='_blank'>Neverwinter Uncensored</a>, a community and software project for the MMORPG Neverwinter by Cryptic Studios and Perfect World Entertainment.",
            "edom": "Software development team member at <a href='https://www.e-domizil.de/' target='_blank'>e-domizil.de</a>, an online travel agency for holiday homes."
        }
    },
    "skills": {
        "software": "Software",
        "frameworks": "Frameworks / CMS",
        "jspackages": "Javascript Packages",
        "lang": "Languages",
        "js": "JavaScript",
        "php": "PHP",
        "wp": "Wordpress",
        "sql": "SQL",
        "jquery": "jQuery"
    },
    "projects": {
        "learnmore": "Learn more",
        "skillsep": ", ",
        "mmb": {
            "desc": "MavsMoneyball was mainly a blogging project. It was great to cover a sport that I love and a team that I root for. But I did also develop a statistical app to complement my blog work."
        },
        "nwoun": {
            "desc": "NWO:UN has been my biggest personal project to date. We served the game's community for nearly five years and delivered content and tools to over 100,000 players per month."
        }
    },
    "project": {
        "desc": "Description",
        "highlights": "Key Features / Achievements",
        "skills": "Used Skills",
        "gallery": "Gallery",
        "links": {
            "web": "Website",
            "github": "Repository"
        },
        "nwoun": {
            "desc": "Neverwinter Uncensored was born in 2015 because I was searching for an independent news platform and community for a MMORPG I had played since 2013. And because there was none, I created it myself! Originally started as a fan project, NWO:UN grew to become the game's #1 fan site. In the heyday, we delivered our content and tools to over 100,000 players per month.<br /><br />It was truly an insane experience. Building and managing a community and website is just so diverse. The core of the project was a Wordpress blog, which I customized (HTML, CSS, JS) to fit my needs, and online tools for the game build with the plugin system of a forum software (PHP, HTML, Javascript). But I also gained tons of experience in social platforms (Twitter, Discord, Facebook etc.), creating content (YouTube, Wordpress), as well as SEO, SEA, and monetization.",
            "highlights": {
                "1": {
                    "1": "Customized Wordpress Blog",
                    "2": "Integrated dozens of plugins",
                    "3": "Theme tweaks and plenty UI enhancements"
                },
                "2": {
                    "1": "Game-Specific Apps",
                    "2": "Data fetching without official API",
                    "3": "Unique PHP/Javascript based online tools"
                },
                "3": {
                    "1": "Monthly Traffic",
                    "2": "100,000+ Users",
                    "3": "350,000+ Page Views"
                },
                "4": {
                    "1": "Social Management",
                    "2": "Communities on Twitter, Discord, Facebook",
                    "3": "Integrated many social APIs"
                },
                "5": {
                    "1": "Full Branding",
                    "2": "Logos, Banners & Color Scheme",
                    "3": "Hundreds of self-made images"
                }
            }
        },
        "mmb": {
            "desc": "Neverwinter Uncensored was born in 2015 because I was searching for an independent news platform and community for a MMORPG I had played since 2013. And because there was none, I created it myself! Originally started as a fan project, NWO:UN grew to become the game's #1 fan site. In the heyday, we delivered our content and tools to over 100,000 players per month.<br /><br />It was truly an insane experience. Building and managing a community and website is just so diverse. The core of the project was a Wordpress blog, which I customized (HTML, CSS, JS) to fit my needs, and online tools for the game build with the plugin system of a forum software (PHP, HTML, Javascript). But I also gained tons of experience in social platforms (Twitter, Discord, Facebook etc.), creating content (YouTube, Wordpress), as well as SEO, SEA, and monetization.",
            "highlights": {
                "1": {
                    "1": "Customized Wordpress Blog",
                    "2": "Integrated dozens of plugins",
                    "3": "Theme tweaks and plenty UI enhancements"
                },
                "2": {
                    "1": "Game-Specific Apps",
                    "2": "Data fetching without official API",
                    "3": "Unique PHP/Javascript based online tools"
                },
                "3": {
                    "1": "Monthly Traffic",
                    "2": "100,000+ Users",
                    "3": "350,000+ Page Views"
                },
                "4": {
                    "1": "Social Management",
                    "2": "Communities on Twitter, Discord, Facebook",
                    "3": "Integrated many social APIs"
                },
                "5": {
                    "1": "Full Branding",
                    "2": "Logos, Banners & Color Scheme",
                    "3": "Hundreds of self-made images"
                }
            }
        }
    }
}